In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
#Ingesting data and printing out head to get better understanding of structure
data = pd.read_csv('csv.csv')
print("Shape:", data.shape)
data.head(5)

Shape: (9999, 15)

,Month,AustralianPort,ForeignPort,Country,Passengers_In,Freight_In_(tonnes),Mail_In_(tonnes),Passengers_Out,Freight_Out_(tonnes),Mail_Out_(tonnes),Passengers_Total,Freight_Total_(tonnes),Mail_Total_(tonnes),Year,Month_num
0,Jan-85,Adelaide,Auckland,New Zealand,1513,42.167,0.311,985,18.704,0.924,2498,60.871,1.235,1985,1
1,Jan-85,Adelaide,Bahrain,Bahrain,12,0.000,0.000,5,0.033,0.000,17,0.033,0.000,1985,1
2,Jan-85,Adelaide,Bombay,India,7,0.000,0.000,5,0.000,0.000,12,0.000,0.000,1985,1
3,Jan-85,Adelaide,Frankfurt,Germany,115,0.009,0.000,171,0.000,0.248,286,0.009,0.248,1985,1
4,Jan-85,Adelaide,London,UK,1567,2.800,0.000,1472,10.618,2.487,3039,13.418,2.487,1985,1

In [17]:
#Quick check to see if there are any Null values and get a sense of what the data types are
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Month                   9999 non-null   object
 1   AustralianPort          9999 non-null   object
 2   ForeignPort             9999 non-null   object
 3   Country                 9999 non-null   object
 4   Passengers_In           9999 non-null   int64
 5   Freight_In_(tonnes)     9999 non-null   float64
 6   Mail_In_(tonnes)        9999 non-null   float64
 7   Passengers_Out          9999 non-null   int64
 8   Freight_Out_(tonnes)    9999 non-null   float64
 9   Mail_Out_(tonnes)       9999 non-null   float64
 10  Passengers_Total        9999 non-null   int64
 11  Freight_Total_(tonnes)  9999 non-null   float64
 12  Mail_Total_(tonnes)     9999 non-null   float64
 13  Year                    9999 non-null   int64
 14  Month_num               9999 non-null   int64
dtypes: float64(6), int64(5), object(4)
memory usage: 1.1+ MB

In [18]:
data['Route'] = data['AustralianPort'] + " - " + data['ForeignPort']
print("Total unique routes:", data['Route'].nunique())

Total unique routes: 306

In [19]:
data['Date'] = pd.to_datetime(data['Year'].astype(str) + '-' + data['Month_num'].astype(str), format="%Y-%m")

In [22]:
data = data[['Date', 'AustralianPort', 'ForeignPort', 'Country', 'Route',
         'Passengers_In', 'Passengers_Out', 'Passengers_Total',
         'Freight_In_(tonnes)', 'Freight_Out_(tonnes)', 'Freight_Total_(tonnes)',
         'Mail_In_(tonnes)', 'Mail_Out_(tonnes)', 'Mail_Total_(tonnes)']]

In [23]:
data.head(5)

,Date,AustralianPort,ForeignPort,Country,Route,Passengers_In,Passengers_Out,Passengers_Total,Freight_In_(tonnes),Freight_Out_(tonnes),Freight_Total_(tonnes),Mail_In_(tonnes),Mail_Out_(tonnes),Mail_Total_(tonnes)
0,1985-01-01,Adelaide,Auckland,New Zealand,Adelaide - Auckland,1513,985,2498,42.167,18.704,60.871,0.311,0.924,1.235
1,1985-01-01,Adelaide,Bahrain,Bahrain,Adelaide - Bahrain,12,5,17,0.000,0.033,0.033,0.000,0.000,0.000
2,1985-01-01,Adelaide,Bombay,India,Adelaide - Bombay,7,5,12,0.000,0.000,0.000,0.000,0.000,0.000
3,1985-01-01,Adelaide,Frankfurt,Germany,Adelaide - Frankfurt,115,171,286,0.009,0.000,0.009,0.000,0.248,0.248
4,1985-01-01,Adelaide,London,UK,Adelaide - London,1567,1472,3039,2.800,10.618,13.418,0.000,2.487,2.487

In [24]:
duplicate_rows = data[data.duplicated()]
len(duplicate_rows)

0

In [26]:
invalid_passenger_rows = data[(data['Passengers_Total'] <= 0) | 
                            (data['Passengers_In'] < 0) | 
                            (data['Passengers_Out'] < 0)]

print(f"Invalid passenger rows: {len(invalid_passenger_rows)}")

Invalid passenger rows: 44

In [ ]:
# Check unique values
print("Unique Australian ports:", data['AustralianPort'].unique())
print("Unique Foreign ports:", data['ForeignPort'].unique())

# Standardize casing
data['AustralianPort'] = data['AustralianPort'].str.title().str.strip()
data['ForeignPort'] = data['ForeignPort'].str.title().str.strip()
data['Country'] = data['Country'].str.title().str.strip()

Unique Australian ports: ['Adelaide' 'Brisbane' 'Cairns' 'Darwin' 'Hobart' 'Melbourne'
 'Norfolk Island' 'Perth' 'Port Hedland' 'Sydney' 'Townsville']
Unique Foreign ports: ['Auckland' 'Bahrain' 'Bombay' 'Frankfurt' 'London' 'Muscat' 'Rome'
 'Singapore' 'Abu Dhabi' 'Bangkok' 'Christchurch' 'Hong Kong' 'Honiara'
 'Honolulu' 'Kuala Lumpur' 'Los Angeles' 'Manila' 'Nadi' 'Noumea'
 'Port Moresby' 'Port Vila' 'San Francisco' 'Suva' 'Tokyo' 'Vancouver'
 'Wellington' 'Bandar Seri Begawan' 'Denpasar' 'Jakarta' 'Amsterdam'
 'Athens' 'Beijing' 'Belgrade' 'Colombo' 'Dubai' 'Houston' 'Larnaca'
 'Manchester' 'Mauritius' 'Nauru' 'New York' 'Papeete' 'Harare'
 'Johannesburg' 'Apia' 'Guangzhou' 'Paris' 'Copenhagen' 'Seattle'
 'Ljubljana' 'Zagreb' 'Kupang' 'Denver' 'Toronto' 'Rarotonga' 'New Delhi'
 'Nagoya' 'Dunedin' 'Pago Pago' 'Vienna' 'Kieta' 'Buenos Aires' 'Chicago'
 'Guam' 'Fukuoka' 'Malta']

In [ ]:
# Total passenger traffic by route
route_traffic = data.groupby('Route')['Passengers_Total'].sum().sort_values(ascending=False)

# Top and bottom 10 routes
top_routes = route_traffic.head(10)
bottom_routes = route_traffic.tail(10)

print("Top 10 Routes:\n", top_routes)
print("\nBottom 10 Routes:\n", bottom_routes)

# Plotting
plt.figure(figsize=(12,5))
sns.barplot(x=top_routes.values, y=top_routes.index, palette='viridis')
plt.title("Top 10 Highest Trafficked Routes")
plt.xlabel("Total Passengers")
plt.ylabel("Route")
plt.show()

NameError: name 'df' is not defined